================================================================================
Ellipsis
================================================================================

...

--------------------------------------------------------------------------------

(program
  (semgrep_ellipsis))

================================================================================
Top level statements
================================================================================

foo();
...
bar();

--------------------------------------------------------------------------------

(program
  (expression_statement
    (method_invocation
      (identifier)
      (argument_list)))
  (semgrep_ellipsis)
  (expression_statement
    (method_invocation
      (identifier)
      (argument_list))))

================================================================================
Top level public constructor
================================================================================

public Foo(...) { }

--------------------------------------------------------------------------------

(program
  (constructor_declaration
    (modifiers)
    (identifier)
    (formal_parameters
      (formal_parameter
        (semgrep_ellipsis)))
    (constructor_body)))

================================================================================
Top level bare constructor
================================================================================

Foo(...) { }

--------------------------------------------------------------------------------

(program
  (constructor_declaration
    (identifier)
    (formal_parameters
      (formal_parameter
        (semgrep_ellipsis)))
    (constructor_body)))

================================================================================
Top level record
================================================================================

public record $R(...) {
   ...
}

--------------------------------------------------------------------------------

(program
  (record_declaration
    (modifiers)
    (identifier)
    (formal_parameters
      (formal_parameter
        (semgrep_ellipsis)))
    (class_body
      (semgrep_ellipsis))))

================================================================================
Method header
================================================================================

public int foo(...)

--------------------------------------------------------------------------------

(program
  (partials
    (partial_method
      (modifiers)
      (integral_type)
      (identifier)
      (formal_parameters
        (formal_parameter
          (semgrep_ellipsis))))))

================================================================================
Constructor body ellipsis
================================================================================

public Foo(...) {
  ...
}

--------------------------------------------------------------------------------

(program
  (constructor_declaration
    (modifiers)
    (identifier)
    (formal_parameters
      (formal_parameter
        (semgrep_ellipsis)))
    (constructor_body
      (semgrep_ellipsis))))

================================================================================
Ellipsis args
================================================================================

foo(..., 5)

--------------------------------------------------------------------------------

(program
  (method_invocation
    (identifier)
    (argument_list
      (semgrep_ellipsis)
      (decimal_integer_literal))))

================================================================================
Ellipsis in if
================================================================================

if (...) {
  ...
}

--------------------------------------------------------------------------------

(program
  (if_statement
    (parenthesized_expression
      (semgrep_ellipsis))
    (block
      (semgrep_ellipsis))))

================================================================================
Metavariable
================================================================================

class $X {
  $X() { }
  void $ASDF() {
    int $QWERTY = $UIOP;
  }
}

--------------------------------------------------------------------------------

(program
  (class_declaration
    (identifier)
    (class_body
      (constructor_declaration
        (identifier)
        (formal_parameters)
        (constructor_body))
      (method_declaration
        (void_type)
        (identifier)
        (formal_parameters)
        (block
          (local_variable_declaration
            (integral_type)
            (variable_declarator
              (identifier)
              (identifier))))))))

================================================================================
Named ellipsis parameter
================================================================================

class $X {
  void $ASDF($...PARAMS) {
  }
}

--------------------------------------------------------------------------------

(program
  (class_declaration
    (identifier)
    (class_body
      (method_declaration
        (void_type)
        (identifier)
        (formal_parameters
          (formal_parameter
            (semgrep_named_ellipsis)))
        (block)))))

================================================================================
Named ellipsis statements
================================================================================

foo();
$...STMTS
bar();

--------------------------------------------------------------------------------

(program
  (expression_statement
    (method_invocation
      (identifier)
      (argument_list)))
  (semgrep_named_ellipsis)
  (expression_statement
    (method_invocation
      (identifier)
      (argument_list))))

================================================================================
Named ellipsis expression
================================================================================

1 + $...NAMED;

--------------------------------------------------------------------------------

(program
  (expression_statement
    (binary_expression
      (decimal_integer_literal)
      (semgrep_named_ellipsis))))

================================================================================
Named ellipsis expression
================================================================================

int x = (void $X);

--------------------------------------------------------------------------------

(program
  (local_variable_declaration
    (integral_type)
    (variable_declarator
      (identifier)
      (typed_metavariable
        (void_type)
        (identifier)))))


================================================================================
Deep ellipsis
================================================================================

int x = <... 1 ...>;

--------------------------------------------------------------------------------

(program
  (local_variable_declaration
    (integral_type)
    (variable_declarator
      (identifier)
      (deep_ellipsis
      (decimal_integer_literal)))))